adwords_api/examples/adwords_on_rails/app/views/campaign/add_ad_group.html.erb

SELECT "keywords".* FROM "keywords" WHERE "keywords"."ad_group_id" = 7
---
	<td><%= ad_group.name %></td>
	<td><%= ad_group.keywords.length %></td>