adwords_api/examples/adwords_on_rails/app/views/ad_groups/show.html.erb

SELECT "keywords".* FROM "keywords" WHERE "keywords"."ad_group_id" = 7
---

<% @ad_group.keywords.each do |key| %>