adwords_api/examples/adwords_on_rails/app/controllers/ad_groups_controller.rb

  def index
    @ad_groups = AdGroup.all
---
SELECT "ad_groups".* FROM "ad_groups"

  def show
    @ad_group = AdGroup.find(params[:id])
---
SELECT "ad_groups".* FROM "ad_groups" WHERE "ad_groups"."id" = ? LIMIT 1  [["id", "new_generic_ad_group"]]

  def create
		if !AdGroup.find_by_name(params[:ad_group_name]) then
			@ad_group = AdGroup.new()
			@ad_group.name = params[:ad_group_name]
			keys = params[:keywords].split("\n") unless !params[:keywords]
			l_keys = params[:loc_keywords].split("\n") unless !params[:loc_keywords]
			keys.each do |key|
				if key!="" then
					k = Keyword.new
					k.value = key
					if key[0]=='"'
						k.match = "phrase"
					elsif key[0]=='['
						k.match = "exact"
					elsif key.include? "+"
						k.match = "broad modifier"
					else
						k.match = "broad"
					end
					k.location = false
					k.ad_group = @ad_group
					k.save
---
SELECT "ad_groups".* FROM "ad_groups" WHERE "ad_groups"."name" = 'Test Group 3' LIMIT 1
INSERT INTO "ad_groups" ("created_at", "keyword_id", "name", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 08 Jul 2014 23:06:05 UTC +00:00], ["keyword_id", nil], ["name", "Test Group 1"], ["updated_at", Tue, 08 Jul 2014 23:06:05 UTC +00:00], ["url", nil]]
INSERT INTO "keywords" ("ad_group_id", "created_at", "location", "match", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?)

	def add_keys
		@ad_group = AdGroup.find(params[:ad_group_id])
		keys = params[:keywords].split("\n") unless !params[:keywords]
		keys.each do |key|
				if key!="" then
					k = Keyword.new
					k.value = key
					if key[0]=='"'
						k.match = "phrase"
					elsif key[0]=='['
						k.match = "exact"
					elsif key.include? "+"
						k.match = "broad modifier"
					else
						k.match = "broad"
					end
					k.location = false
					k.ad_group = @ad_group
					k.save
---
SELECT "ad_groups".* FROM "ad_groups" WHERE "ad_groups"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "keywords".* FROM "keywords" WHERE "keywords"."ad_group_id" = 7
INSERT INTO "keywords" ("ad_group_id", "created_at", "location", "match", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?)

	def del_key
		k = Keyword.find(params[:keyword_id])
		@ad_group = k.ad_group
		k.destroy
---
SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT 1  [["id", "46"]]
DELETE FROM "keywords" WHERE "keywords"."id" = ?  [["id", 46]]

	def make_loc
		k = Keyword.find(params[:keyword_id])
		puts "KEYWORD: ", k.value if k.match.include? "broad"
		@ad_group = k.ad_group
		if k.match.include? "broad"
			k.location = true
			k.save
---
SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT 1  [["id", "13"]]
SELECT "ad_groups".* FROM "ad_groups" WHERE "ad_groups"."id" = 7 LIMIT 1
UPDATE "keywords" SET "location" = 't', "updated_at" = '2014-07-09 16:17:16.567251' WHERE "keywords"."id" = 13

	def show_keys
		group_id = params[:ad_group_id]
		puts "AD GROUP ID:", group_id
		group_id["show"]=""
		@ad_group = AdGroup.find(group_id)
---
SELECT "ad_groups".* FROM "ad_groups" WHERE "ad_groups"."id" = ? LIMIT 1  [["id", "7"]]

	def close_keys
		@ad_group = AdGroup.find(params[:ad_group_id])
---
SELECT "ad_groups".* FROM "ad_groups" WHERE "ad_groups"."id" = ? LIMIT 1  [["id", "7"]]