adwords_api/examples/adwords_on_rails/app/controllers/campaign_controller.rb

SELECT "ad_groups".* FROM "ad_groups"
---
  def add_ad_group()
	@selected_account = selected_account

    if @selected_account
      response = request_campaigns_list()
      if response
        @campaigns = Campaign.get_campaigns_list(response)
        @campaign_count = response[:total_num_entries]
      end
    end
    if @selected_account
      response = request_budgets_list()
      if response
        @budgets = Budget.get_budgets_list(response)
        @budget_count = response[:total_num_entries]
      end
    end
    @ad_groups = AdGroup.all

SELECT "ad_groups".* FROM "ad_groups" WHERE "ad_groups"."id" = ? LIMIT 1  [["id", "7"]]
---
  def new_ad_groups()
		adwords = AdwordsApi::Api.new
		ad_group_srv = adwords.service(:AdGroupService, :v201402)
		ad_group_criterion_srv = adwords.service(:AdGroupCriterionService, :v201402)
		keywords = []
		ags = []
		aw_ags = []
		aw_ag_ids = []
		group_ids = params[:ad_group_ids]
		group_ids.each do |ad_group_id|
			ad_group_id["_:id__"] = ""
			ad_group_id["_"] = ""
			ag = AdGroup.find(ad_group_id)